In [6]:
import cx_Oracle  
import pandas as pd  
import time

In [20]:
uid = "SYSTEM"    # usuário
pwd = "sysdba"   # senha
db = "localhost:1521"  # string de conexão do Oracle
sql = '''SELECT id FROM   tab_transito ORDER BY DBMS_RANDOM.VALUE FETCH NEXT 50 ROWS ONLY'''#  WHERE  ROWNUM <= 10000'''

In [21]:
class Conexao(cx_Oracle.Connection):  
    def cursor(self):  
        cursor = super(Conexao, self).cursor()  
        cursor.arraysize = 5000  
        return cursor  
  
conn = Conexao(uid, pwd, db, encoding="UTF-8", nencoding="UTF-8")  
print('''ArraySize: ''', conn.cursor().arraysize)

ArraySize:  5000

In [22]:
# Create empty list
lista_chunck= [] 
# Start Chunking 
i=1
# iniciar contador
start = time.time()
for chunk in pd.read_sql(sql, con=conn, chunksize=500000):
    # Start Appending Data Chunks from SQL Result set into List
    elapsed = (time.time() - start)
    print(elapsed/60," Minutos chunck", i)
    i= i+1
    lista_chunck.append(chunk)
conn.close()
    
elapsed = (time.time() - start)
print(elapsed/60, " Minutos chunck")
lista_chunck

0.003464674949645996  Minutos chunck 1
0.0035313208897908527  Minutos chunck

[        ID
 0   376492
 1   371406
 2   379178
 3   379568
 4   383060
 5   380564
 6   376120
 7   375116
 8   383631
 9   387292
 10  388555
 11  383623
 12  381470
 13  382599
 14  386313
 15  386799
 16  384323
 17  372742
 18  387963
 19  387803
 20  374855
 21  375072
 22  388910
 23  387754
 24  386055
 25  381701
 26  378947
 27  386119
 28  375202
 29  388168
 30  376594
 31  381987
 32  370077
 33  375620
 34  376247
 35  386839
 36  378690
 37  381483
 38  382763
 39  377370
 40  389329
 41  382098
 42  389828
 43  376064
 44  372351
 45  371365
 46  374469
 47  381335
 48  374525
 49  379835]

In [23]:
# Create empty dataframe
df = pd.DataFrame()  
start = time.time()
# Start appending data from list to dataframe
df = pd.concat(lista_chunck, ignore_index=True)

elapsed = (time.time() - start)
print(elapsed/60, " Minutos, minutos total")

3.330707550048828e-05  Minutos, minutos total

In [24]:
df.shape

(50, 1)

In [25]:
df.dtypes

ID    int64
dtype: object

In [26]:
df.head()

       ID
0  376492
1  371406
2  379178
3  379568
4  383060

In [27]:
df.to_csv('Lista.csv', index= False)